churchja/esp32-workbench/projects/lilygo-amoled-demo/sdkconfig.defaults
    # This file was generated using idf.py save-defconfig. It can be edited manually.
    # Espressif IoT Development Framework (ESP-IDF) 6.0.0 Project Minimal Configuration
    #
    # default:
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_BT_ENABLED=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=n
CONFIG_ETH_USE_SPI_ETHERNET=n
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n
CONFIG_LCD_ENABLE_DEBUG_LOG=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_WS_TRANSPORT=n
CONFIG_LV_FONT_MONTSERRAT_14=n
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_28=y
CONFIG_LV_BUILD_EXAMPLES=n

# --- LilyGo T-Display-S3 AMOLED **Plus** (BOARD_AMOLED_191_SPI) ---
# The example ships QSPI defaults, which target the NON-TOUCH sibling. This
# board is the Plus: RM67162 over regular SPI with d2/d3 unpopulated, per
# LilyGo_AMOLED.h's RM67162_AMOLED_SPI config. Pins are otherwise identical.
CONFIG_HWE_DISPLAY_SPI_SPI=y
CONFIG_HWE_DISPLAY_SPI_FREQUENCY=40000000
